# Pandas로 데이터 읽어오기

In [221]:
import pandas as pd

In [222]:
CCTV_Seoul = pd.read_csv('../data/01. CCTV_in_Seoul.csv',  encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [223]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [224]:
CCTV_Seoul.columns[0]

'기관명'

In [225]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [226]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [227]:
pop_Seoul = pd.read_excel('../data/01. population_in_Seoul.xls', 
                          header = 2,
                          usecols = 'B, D, G, J, N')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [228]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별', 
                          pop_Seoul.columns[1] : '인구수', 
                          pop_Seoul.columns[2] : '한국인', 
                          pop_Seoul.columns[3] : '외국인', 
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

# Pandas 기초 (1)

In [229]:
import numpy as np

In [230]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [231]:
dates = pd.date_range('20210808', periods=6)
dates

DatetimeIndex(['2021-08-08', '2021-08-09', '2021-08-10', '2021-08-11',
               '2021-08-12', '2021-08-13'],
              dtype='datetime64[ns]', freq='D')

In [232]:
df = pd.DataFrame(np.random.randint(10000, size=(6,4)), index=dates, columns=(['A','B','C','D']))
df

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034
2021-08-11  6218  5313  8255  6682
2021-08-12  7206  2712  7956  5378
2021-08-13  3022  7348  3391  2723

In [233]:
df.head(3) #head는 앞에 몇개를 보여주라는 명령, default = 5

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034

In [234]:
df.index

DatetimeIndex(['2021-08-08', '2021-08-09', '2021-08-10', '2021-08-11',
               '2021-08-12', '2021-08-13'],
              dtype='datetime64[ns]', freq='D')

In [235]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [236]:
df.values

array([[ 975, 8496, 8946, 6616],
       [4137, 6119, 4352, 3159],
       [4098, 1411, 3136, 1034],
       [6218, 5313, 8255, 6682],
       [7206, 2712, 7956, 5378],
       [3022, 7348, 3391, 2723]])

In [237]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-08-08 to 2021-08-13
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      int64
 1   B       6 non-null      int64
 2   C       6 non-null      int64
 3   D       6 non-null      int64
dtypes: int64(4)
memory usage: 240.0 bytes

In [238]:
df.describe() # 통계적 요소 확인

                 A            B            C            D
count     6.000000     6.000000     6.000000     6.000000
mean   4276.000000  5233.166667  6006.000000  4265.333333
std    2230.532941  2715.691987  2657.628341  2308.602146
min     975.000000  1411.000000  3136.000000  1034.000000
25%    3291.000000  3362.250000  3631.250000  2832.000000
50%    4117.500000  5716.000000  6154.000000  4268.500000
75%    5697.750000  7040.750000  8180.250000  6306.500000
max    7206.000000  8496.000000  8946.000000  6682.000000

In [239]:
df.sort_values(by='B',ascending=False)

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-13  3022  7348  3391  2723
2021-08-09  4137  6119  4352  3159
2021-08-11  6218  5313  8255  6682
2021-08-12  7206  2712  7956  5378
2021-08-10  4098  1411  3136  1034

In [240]:
df

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034
2021-08-11  6218  5313  8255  6682
2021-08-12  7206  2712  7956  5378
2021-08-13  3022  7348  3391  2723

In [241]:
df[:3]

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034

In [242]:
df['20210814':'20210818'] # 범위에 없어도 없다고 나오지 에러 아님 (값이 없을 뿐)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [243]:
df.loc[dates[0]] #특정 행의 값만 보는 것도 가능

A     975
B    8496
C    8946
D    6616
Name: 2021-08-08 00:00:00, dtype: int64

In [244]:
df.loc[:,['A','C']]

               A     C
2021-08-08   975  8946
2021-08-09  4137  4352
2021-08-10  4098  3136
2021-08-11  6218  8255
2021-08-12  7206  7956
2021-08-13  3022  3391

In [245]:
df.loc[['20210808', '20210810'],['A','C']]

               A     C
2021-08-08   975  8946
2021-08-10  4098  3136

In [246]:
df.loc[dates[0],'A']

975

In [247]:
df.iloc[3] # loc와 다른 점은 index를 활용

A    6218
B    5313
C    8255
D    6682
Name: 2021-08-11 00:00:00, dtype: int64

In [248]:
df.iloc[[1,2,4],[0,2]]

               A     C
2021-08-09  4137  4352
2021-08-10  4098  3136
2021-08-12  7206  7956

In [249]:
df.iloc[1:3,:]

               A     B     C     D
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034

In [250]:
df

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034
2021-08-11  6218  5313  8255  6682
2021-08-12  7206  2712  7956  5378
2021-08-13  3022  7348  3391  2723

In [251]:
df[df.A > 5000] # 특정 컬럼에서만

               A     B     C     D
2021-08-11  6218  5313  8255  6682
2021-08-12  7206  2712  7956  5378

In [252]:
df[df > 5000] # 전체에 대해서는 만족하지 않는 것은 NaN(Not a Number) 처리

                 A       B       C       D
2021-08-08     NaN  8496.0  8946.0  6616.0
2021-08-09     NaN  6119.0     NaN     NaN
2021-08-10     NaN     NaN     NaN     NaN
2021-08-11  6218.0  5313.0  8255.0  6682.0
2021-08-12  7206.0     NaN  7956.0  5378.0
2021-08-13     NaN  7348.0     NaN     NaN

In [253]:
df2 = df.copy() # 복사할 때, 이렇게! df2=df 라고 하면, 원본은 하나(위치만 복사 됨)

In [254]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

               A     B     C     D      E
2021-08-08   975  8496  8946  6616    one
2021-08-09  4137  6119  4352  3159    one
2021-08-10  4098  1411  3136  1034    two
2021-08-11  6218  5313  8255  6682  three
2021-08-12  7206  2712  7956  5378   four
2021-08-13  3022  7348  3391  2723  three

In [255]:

df2['E'].isin(['two','four'])

2021-08-08    False
2021-08-09    False
2021-08-10     True
2021-08-11    False
2021-08-12     True
2021-08-13    False
Freq: D, Name: E, dtype: bool

In [256]:

df2[df2['E'].isin(['two','four'])] # isin을 이용하면 T/F가 반환되므로 조건에 맞는 데어터 선택가능

               A     B     C     D     E
2021-08-10  4098  1411  3136  1034   two
2021-08-12  7206  2712  7956  5378  four

In [257]:
df

               A     B     C     D
2021-08-08   975  8496  8946  6616
2021-08-09  4137  6119  4352  3159
2021-08-10  4098  1411  3136  1034
2021-08-11  6218  5313  8255  6682
2021-08-12  7206  2712  7956  5378
2021-08-13  3022  7348  3391  2723

In [258]:
df.apply(np.cumsum) # 누적합 구하기

                A      B      C      D
2021-08-08    975   8496   8946   6616
2021-08-09   5112  14615  13298   9775
2021-08-10   9210  16026  16434  10809
2021-08-11  15428  21339  24689  17491
2021-08-12  22634  24051  32645  22869
2021-08-13  25656  31399  36036  25592

In [259]:
df.apply(lambda x: x.max() - x.min()) # 람다 함수도 이용가능!

A    6231
B    7085
C    5810
D    5648
dtype: int64

# Pandas 이용한 CCTV와 인구 현황 파악

In [260]:
CCTV_Seoul.sort_values(by='소계').head() # 오름차순 정리

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [261]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head() # 내림차순 정리

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [262]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] + CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전']  * 100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [263]:
pop_Seoul.head() # 0번 행의 합계는 필요없음

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [264]:
pop_Seoul.drop([0], inplace=True) # 0번 행 삭제
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [265]:
pop_Seoul['구별'].unique() #nan이 보임

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [266]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [267]:
pop_Seoul.drop([26], inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [268]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100 # 외국인 비율 계산
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100 # 고령자 비율 계산
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [269]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

# Pandas 기초 (2)

## 연습용 데이터

In [270]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [271]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

## DataFrame 병합하기

In [272]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [273]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [274]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [275]:
result = pd.concat([df1,df2,df3]) # 단순히 열 방향으로 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [276]:
result.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [277]:
result = pd.concat([df1,df2,df3], keys=['x','y','z']) # key옵션을 사용하면 다중 index가 되어 level을 형성
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [278]:
result.index

MultiIndex([('x',  0),
            ('x',  1),
            ('x',  2),
            ('x',  3),
            ('y',  4),
            ('y',  5),
            ('y',  6),
            ('y',  7),
            ('z',  8),
            ('z',  9),
            ('z', 10),
            ('z', 11)],
           )

In [279]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [280]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [281]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])

result = pd.concat([df1, df4], axis=1)
print(df4) # 마지막만 실행되니까 print로 실행
result

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [282]:
result = pd.concat([df1, df4], axis=1, join='inner') # join옵션을 inner로 하면 겹치는 부분만
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [283]:
result1 = pd.concat([df1, df4])
result2 = pd.concat([df1, df4], ignore_index=True) # 합치고 index를 재부여
print(result1)
result2

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [284]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [285]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [286]:
pd.merge(left, right, on='key') # 공통된 key에 대해서만 병합

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [287]:
pd.merge(left, right, how='left', on='key') # how옵션으로 기준을 설정

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [288]:
pd.merge(left, right, how='outer', on='key') # how옵션에 'outer'과 'cross'도 있음/ default = 'inner'

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K4   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [289]:
pd.merge(left, right, how='cross')

   key_x   A   B key_y   C   D
0     K0  A0  B0    K0  C0  D0
1     K0  A0  B0    K1  C1  D1
2     K0  A0  B0    K2  C2  D2
3     K0  A0  B0    K3  C3  D3
4     K4  A1  B1    K0  C0  D0
5     K4  A1  B1    K1  C1  D1
6     K4  A1  B1    K2  C2  D2
7     K4  A1  B1    K3  C3  D3
8     K2  A2  B2    K0  C0  D0
9     K2  A2  B2    K1  C1  D1
10    K2  A2  B2    K2  C2  D2
11    K2  A2  B2    K3  C3  D3
12    K3  A3  B3    K0  C0  D0
13    K3  A3  B3    K1  C1  D1
14    K3  A3  B3    K2  C2  D2
15    K3  A3  B3    K3  C3  D3

# CCTV 데이터와 인구 데이터 병합하고 분석하기

In [290]:
data_result = pd.merge(CCTV_Seoul, pop_Seoul, on='구별')
data_result

,구별,소계,2013년도 이전,2014년,2015년,2016년,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
0,강남구,2780,1292,430,584,932,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
1,강동구,773,379,99,155,377,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
2,강북구,748,369,120,138,204,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
3,강서구,884,388,258,184,81,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
4,관악구,1496,846,260,390,613,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291
5,광진구,707,573,78,53,174,53.228621,372164.0,357211.0,14953.0,42214.0,4.017852,11.342849
6,구로구,1561,1142,173,246,323,64.973730,447874.0,416487.0,31387.0,56833.0,7.007998,12.689506
7,금천구,1015,674,51,269,354,100.000000,255082.0,236353.0,18729.0,32970.0,7.342345,12.925255
8,노원구,1265,542,57,451,516,188.929889,569384.0,565565.0,3819.0,71941.0,0.670725,12.634883
9,도봉구,485,238,159,42,386,246.638655,348646.0,346629.0,2017.0,51312.0,0.578524,14.717507
10,동대문구,1294,1070,23,198,579,74.766355,369496.0,354079.0,15417.0,54173.0,4.172440,14.661322
11,동작구,1091,544,341,103,314,139.338235,412520.0,400456.0,12064.0,56013.0,2.924464,13.578251
12,마포구,574,314,118,169,379,212.101911,389649.0,378566.0,11083.0,48765.0,2.844355,12.515110
13,서대문구,962,844,50,68,292,48.578199,327163.0,314982.0,12181.0,48161.0,3.723221,14.720797
14,서초구,1930,1406,157,336,398,63.371266,450310.0,445994.0,4316.0,51733.0,0.958451,11.488308
15,성동구,1062,730,91,241,265,81.780822,311244.0,303380.0,7864.0,39997.0,2.526635,12.850689
16,성북구,1464,1009,78,360,204,63.627354,461260.0,449773.0,11487.0,64692.0,2.490353,14.025062
17,송파구,618,529,21,68,463,104.347826,667483.0,660584.0,6899.0,72506.0,1.033584,10.862599
18,양천구,2034,1843,142,30,467,34.671731,479978.0,475949.0,4029.0,52975.0,0.839413,11.036964
19,영등포구,904,495,214,195,373,157.979798,402985.0,368072.0,34913.0,52413.0,8.663598,13.006191
20,용산구,1624,1368,218,112,398,53.216374,244203.0,229456.0,14747.0,36231.0,6.038828,14.836427
21,은평구,1873,1138,224,278,468,85.237258,494388.0,489943.0,4445.0,72334.0,0.899091,14.631019
22,종로구,1002,464,314,211,630,248.922414,162820.0,153589.0,9231.0,25425.0,5.669451,15.615404
23,중구,671,413,190,72,348,147.699758,133240.0,124312.0,8928.0,20764.0,6.700690,15.583909
24,중랑구,660,509,121,177,109,79.960707,414503.0,409882.0,4621.0,56774.0,1.114829,13.696885

In [291]:
del data_result['2013년도 이전']
del data_result['2014년']
del data_result['2015년']
del data_result['2016년']
data_result.head()

,구별,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
0,강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
1,강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
2,강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
3,강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
4,관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [292]:
data_result.set_index('구별', inplace=True) # index를 '구별'로 설정
print(data_result.index)
data_result.head()

Index(['강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구',
       '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구',
       '용산구', '은평구', '종로구', '중구', '중랑구'],
      dtype='object', name='구별')

,소계,최근증가율,인구수,한국인,외국인,고령자,외국인비율,고령자비율
구별,,,,,,,,
강남구,2780,150.619195,570500.0,565550.0,4950.0,63167.0,0.867660,11.072217
강동구,773,166.490765,453233.0,449019.0,4214.0,54622.0,0.929765,12.051638
강북구,748,125.203252,330192.0,326686.0,3506.0,54813.0,1.061806,16.600342
강서구,884,134.793814,603772.0,597248.0,6524.0,72548.0,1.080540,12.015794
관악구,1496,149.290780,525515.0,507203.0,18312.0,68082.0,3.484582,12.955291

In [296]:
np.corrcoef(data_result['고령자비율'],data_result['소계']) # 상관계수를 알아보는 numpy의 함수 0.1 이하 - 거의 무시 / 0.3 이하 - 약한 상관관계 / 0.7 이하 - 뚜렷한 상관관계

array([[ 1.        , -0.28078554],
       [-0.28078554,  1.        ]])

In [297]:
np.corrcoef(data_result['외국인비율'],data_result['소계'])

array([[ 1.        , -0.13607433],
       [-0.13607433,  1.        ]])

In [298]:
np.corrcoef(data_result['인구수'],data_result['소계'])

array([[1.        , 0.30634228],
       [0.30634228, 1.        ]])